SOAPe/Templates/EWS/CreateFolder.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
               xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
  <soap:Body>
    <m:CreateFolder>
      <m:ParentFolderId>
        <!--FIELD:ParentFolder;FolderId-->
      </m:ParentFolderId>
      <m:Folders>
        <t:Folder>
          <t:DisplayName><!--FIELD:DisplayName;string--></t:DisplayName>
        </t:Folder>
      </m:Folders>
    </m:CreateFolder>
  </soap:Body>
</soap:Envelope>